# PREPROCESSING DATES & TIMES

## Break Up Dates And Times Into Multiple Features

In [8]:
# Load libraries

import pandas as pd

In [14]:
# Create Date And Time Data

df = pd.DataFrame()

# Create five dates 

df['date'] = pd.date_range('1/1/2001' ,periods = 150, freq = 'W')

### Break Up Dates And Times Into Individual Features

In [15]:
# Create features for year, month, day, hour and minute

df['year']  = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day']   = df['date'].dt.day
df['hour']  = df['date'].dt.hour
df['minute']= df['date'].dt.minute

# Show df

df.head(3)

        date  year  month  day  hour  minute
0 2001-01-07  2001      1    7     0       0
1 2001-01-14  2001      1   14     0       0
2 2001-01-21  2001      1   21     0       0

# Calculate Difference Between Dates And Times

In [13]:
# Load libraries 

import pandas as pd

In [24]:
# Create Date and Time Data

df = pd.DataFrame()

# Create two datetime features

df['Hoy'] = [pd.Timestamp('08-30-2018'), pd.Timestamp('08-30-2018'),pd.Timestamp('08-30-2018'),pd.Timestamp('08-30-2018')]
df['Cumple'] = [pd.Timestamp('06-04-1959'), pd.Timestamp('06-04-1989'),pd.Timestamp('12-09-1993'),pd.Timestamp('10-17-1958')]

df

         Hoy     Cumple
0 2018-08-30 1959-06-04
1 2018-08-30 1989-06-04
2 2018-08-30 1993-12-09
3 2018-08-30 1958-10-17

### Calculate Difference (Method 1)

In [41]:
# Calculate duration between features

df['Días Vividos'] = df['Hoy'] - df['Cumple']
df['Telerín'] = ['Mama', 'Kike', 'Nacho', 'Papa']
df['Segundos'] = ((df['Hoy'] - df['Cumple']).dt.total_seconds()).astype(int)

df

         Hoy     Cumple Días vividos Telerín Días Vividos    Segundos
0 2018-08-30 1959-06-04   21637 days    Mama   21637 days  1869436800
1 2018-08-30 1989-06-04   10679 days    Kike   10679 days   922665600
2 2018-08-30 1993-12-09    9030 days   Nacho    9030 days   780192000
3 2018-08-30 1958-10-17   21867 days    Papa   21867 days  1889308800

### Calculate Difference (Method 2)

In [26]:
# Calculate duration between features 

pd.Series(delta.days for delta in (df['Hoy']-df['Cumple']))

0    21637
1    10679
2     9030
3    21867
dtype: int64

## SET COLUMN TO INDEX

In [68]:
df1 = df.set_index(df['Telerín'])
df1

               Hoy     Cumple Días vividos Telerín Días Vividos    Segundos
Telerín
Mama    2018-08-30 1959-06-04   21637 days    Mama   21637 days  1869436800
Kike    2018-08-30 1989-06-04   10679 days    Kike   10679 days   922665600
Nacho   2018-08-30 1993-12-09    9030 days   Nacho    9030 days   780192000
Papa    2018-08-30 1958-10-17   21867 days    Papa   21867 days  1889308800

### Drop column

In [69]:
df1 = df1.drop('Telerín',1)    # 0 para filas 
df1                            # 1 para columnas

               Hoy     Cumple Días vividos Días Vividos    Segundos
Telerín
Mama    2018-08-30 1959-06-04   21637 days   21637 days  1869436800
Kike    2018-08-30 1989-06-04   10679 days   10679 days   922665600
Nacho   2018-08-30 1993-12-09    9030 days    9030 days   780192000
Papa    2018-08-30 1958-10-17   21867 days   21867 days  1889308800

# CONVERT STRINGS TO DATES

In [70]:
# Load libraries

import numpy as np
import pandas as pd

### Create strings

In [72]:
date_strings = np.array(['03-04-2005 11:35 PM',
                         '23-05-2010 12:01 AM',
                         '04-09-2009 09:09 PM'])
date_strings

array(['03-04-2005 11:35 PM', '23-05-2010 12:01 AM', '04-09-2009 09:09 PM'],
      dtype='<U19')

## Convert strings to TimeStamps

#### If errors = 'coerce' then any problem will not raise an error (the default behaviour) but instead will set the value causing the error to NaT (ie: missing value)

In [74]:
meanings = pd.DataFrame()
meanings

Empty DataFrame
Columns: []
Index: []

In [77]:
meanings['Code'] = ['%Y', '%m', '%d', '%I', '%p', '%M', '%S']
meanings['Description'] = ['Full Year', 'Month with zero padding', 'Day of the month with zero padding', 'Hour (12h clock) with zero padding', 'AM or PM', 'Minute with zero padding', 'Second with zero padding']
meanings['Example'] = ['2001', '04', '09' ,'02', 'AM', '05', '09']
meanings

  Code                         Description Example
0   %Y                           Full Year    2001
1   %m             Month with zero padding      04
2   %d  Day of the month with zero padding      09
3   %I  Hour (12h clock) with zero padding      02
4   %p                            AM or PM      AM
5   %M            Minute with zero padding      05
6   %S            Second with zero padding      09

In [85]:
meanings = meanings.set_index(meanings['Code'])

meanings

     Code                         Description Example
Code
%Y     %Y                           Full Year    2001
%m     %m             Month with zero padding      04
%d     %d  Day of the month with zero padding      09
%I     %I  Hour (12h clock) with zero padding      02
%p     %p                            AM or PM      AM
%M     %M            Minute with zero padding      05
%S     %S            Second with zero padding      09

In [88]:
meanings.drop('Code',1)

                             Description Example
Code
%Y                             Full Year    2001
%m               Month with zero padding      04
%d    Day of the month with zero padding      09
%I    Hour (12h clock) with zero padding      02
%p                              AM or PM      AM
%M              Minute with zero padding      05
%S              Second with zero padding      09

In [89]:
# Convert to datetimes

[pd.to_datetime(date, format='%d-%m-%Y %I:%M %p', errors = 'coerce') for date in date_strings]

[Timestamp('2005-04-03 23:35:00'),
 Timestamp('2010-05-23 00:01:00'),
 Timestamp('2009-09-04 21:09:00')]

# Convert pandas Columns Time Zone

In [90]:
# Load libraries

import pandas as pd
from pytz import all_timezones

In [95]:
# View Timezones

all_timezones[0:10]

['Africa/Abidjan',
 'Africa/Accra',
 'Africa/Addis_Ababa',
 'Africa/Algiers',
 'Africa/Asmara',
 'Africa/Asmera',
 'Africa/Bamako',
 'Africa/Bangui',
 'Africa/Banjul',
 'Africa/Bissau']

In [97]:
# Create pandas series of dates (10 dates)

dates = pd.Series(pd.date_range('2/2/2002', periods = 10, freq = 'M'))
dates

0   2002-02-28
1   2002-03-31
2   2002-04-30
3   2002-05-31
4   2002-06-30
5   2002-07-31
6   2002-08-31
7   2002-09-30
8   2002-10-31
9   2002-11-30
dtype: datetime64[ns]

In [98]:
# Add time zone of pandas Series

# Set time zone

dates_with_abijdan_tz = dates.dt.tz_localize('Africa/Abidjan')
dates_with_abijdan_tz

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 00:00:00+00:00
3   2002-05-31 00:00:00+00:00
4   2002-06-30 00:00:00+00:00
5   2002-07-31 00:00:00+00:00
6   2002-08-31 00:00:00+00:00
7   2002-09-30 00:00:00+00:00
8   2002-10-31 00:00:00+00:00
9   2002-11-30 00:00:00+00:00
dtype: datetime64[ns, Africa/Abidjan]

### Convert time zone of pandas series

In [99]:
# Convert time zone

dates_with_london_tz= dates_with_abijdan_tz.dt.tz_convert('Europe/London')
dates_with_london_tz

0   2002-02-28 00:00:00+00:00
1   2002-03-31 00:00:00+00:00
2   2002-04-30 01:00:00+01:00
3   2002-05-31 01:00:00+01:00
4   2002-06-30 01:00:00+01:00
5   2002-07-31 01:00:00+01:00
6   2002-08-31 01:00:00+01:00
7   2002-09-30 01:00:00+01:00
8   2002-10-31 00:00:00+00:00
9   2002-11-30 00:00:00+00:00
dtype: datetime64[ns, Europe/London]

# Encode Days Of The Week

In [ ]:
# Load libraries

import pandas as pd

In [102]:
# Create date and time data
#Create dates

dates = pd.Series(pd.date_range('04/06/1989', periods = 3, freq = 'M'))
dates

0   1989-04-30
1   1989-05-31
2   1989-06-30
dtype: datetime64[ns]

### Show days of the week

In [103]:
# Show week days

dates.dt.weekday_name

0       Sunday
1    Wednesday
2       Friday
dtype: object

# Handling Missing Values In Time Series

In [104]:
# Load Libraries

import pandas as pd
import numpy as np

### Create date data with gap in values

In [108]:
# Create date

time_index = pd.date_range('01/01/2010', periods = 5, freq = 'M')
time_index

DatetimeIndex(['2010-01-31', '2010-02-28', '2010-03-31', '2010-04-30',
               '2010-05-31'],
              dtype='datetime64[ns]', freq='M')

In [110]:
# Create data frame, set index

df = pd.DataFrame(index=time_index)
df

Empty DataFrame
Columns: []
Index: [2010-01-31 00:00:00, 2010-02-28 00:00:00, 2010-03-31 00:00:00, 2010-04-30 00:00:00, 2010-05-31 00:00:00]

In [112]:
# Create feature with a gap of missing values

df['Sales'] = [1.0,2.0,np.nan,np.nan, 5.0]
df

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    NaN
2010-04-30    NaN
2010-05-31    5.0

### Interpolate Missing Values

In [113]:
# Interpolate missing values

df.interpolate()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    4.0
2010-05-31    5.0

### Forward-fill Missing Values

In [114]:
# Forward fill

df.ffill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    2.0
2010-04-30    2.0
2010-05-31    5.0

### Backfill Missing Values

In [115]:
# Back fill

df.bfill()

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    5.0
2010-04-30    5.0
2010-05-31    5.0

### Interpolate Missing Values But Only Up One Value

In [116]:
# Interpolate missing values 

df.interpolate(limit=1, limit_direction = 'forward')

            Sales
2010-01-31    1.0
2010-02-28    2.0
2010-03-31    3.0
2010-04-30    NaN
2010-05-31    5.0

# Lag a time feature

In [117]:
# Load libraries

import pandas as pd

In [120]:
# Create data frame

df = pd.DataFrame()

# Create data

df['dates']= pd.date_range('1/1/2001', periods = 5, fres = 'D')
df['stock_price'] = [1.1,2.2,3.3,4.4,5.5]
df

       dates  stock_price
0 2001-01-01          1.1
1 2001-01-02          2.2
2 2001-01-03          3.3
3 2001-01-04          4.4
4 2001-01-05          5.5

### Lag Time Data By One Row

In [124]:
# Lagged values by one row

df['previous_days_stock_price'] = df['stock_price'].shift(1)
df

       dates  stock_price  previous_days_stock_price
0 2001-01-01          1.1                        NaN
1 2001-01-02          2.2                        1.1
2 2001-01-03          3.3                        2.2
3 2001-01-04          4.4                        3.3
4 2001-01-05          5.5                        4.4

# Rolling Time Window

In [125]:
# Load Libraries

import pandas as pd

In [129]:
# Create data

# Create datetimes

time_index = pd.date_range('01/01/2010', periods = 5, freq = 'M')

# Create data frame, set index

df = pd.DataFrame(index=time_index)

# Create feature

df['Stock_Price'] = [1,2,3,4,5]
df

            Stock_Price
2010-01-31            1
2010-02-28            2
2010-03-31            3
2010-04-30            4
2010-05-31            5

### Create A Rolling Time Window Of Two Rows

In [135]:
# Calculate rolling mean

df.rolling(window=2).mean()

            Stock_Price
2010-01-31          NaN
2010-02-28          1.5
2010-03-31          2.5
2010-04-30          3.5
2010-05-31          4.5

In [134]:
# Identify max value in rolling time window

df.rolling(window=2).max()

            Stock_Price
2010-01-31          NaN
2010-02-28          2.0
2010-03-31          3.0
2010-04-30          4.0
2010-05-31          5.0

# Select Date And Time Ranges

In [1]:
# Load library

import pandas as pd

In [2]:
# Create data frame
df = pd.DataFrame()

# Create datetimes
df['date'] = pd.date_range('1/1/2001', periods=100000, freq='H')

### Select Time Range (Method 1)
Use this method if your data frame is not indexed by time.

In [3]:
# Select observations between two datetimes
df[(df['date'] > '2002-1-1 01:00:00') & (df['date'] <= '2002-1-1 04:00:00')]

                    date
8762 2002-01-01 02:00:00
8763 2002-01-01 03:00:00
8764 2002-01-01 04:00:00

### Select Time Range (Method 2)
Use this method if your data frame is indexed by time.

In [6]:
# Set index
df = df.set_index(df['date'])

df.head(10)

                                   date
date
2001-01-01 00:00:00 2001-01-01 00:00:00
2001-01-01 01:00:00 2001-01-01 01:00:00
2001-01-01 02:00:00 2001-01-01 02:00:00
2001-01-01 03:00:00 2001-01-01 03:00:00
2001-01-01 04:00:00 2001-01-01 04:00:00
2001-01-01 05:00:00 2001-01-01 05:00:00
2001-01-01 06:00:00 2001-01-01 06:00:00
2001-01-01 07:00:00 2001-01-01 07:00:00
2001-01-01 08:00:00 2001-01-01 08:00:00
2001-01-01 09:00:00 2001-01-01 09:00:00

In [5]:
# Select observations between two datetimes
df.loc['2002-1-1 01:00:00':'2002-1-1 04:00:00']

                                   date
date
2002-01-01 01:00:00 2002-01-01 01:00:00
2002-01-01 02:00:00 2002-01-01 02:00:00
2002-01-01 03:00:00 2002-01-01 03:00:00
2002-01-01 04:00:00 2002-01-01 04:00:00